pulp-bio/wulpus/fw/msp430/wulpus_msp430_firmware/driverlib/MSP430FR5xx_6xx/saph.h
//*****************************************************************************
//
//! \brief Configures physical interface multiplexer.
//!
//! This configures SAPH physical interface mutliplexer for dummy load, channel
//! multiplexer source control and input channel selection.
//!
//! \param baseAddress is the base address of the SAPH module.
//! \param enableDummyLoad indicates whether to enable/disable dummy load on non-
//!        selected multiplexer inputs.
//!        Valid values are:
//!        - \b SAPH_PHY_DUMMYLOAD_ENABLE
//!        - \b SAPH_PHY_DUMMYLOAD_DISABLE [Default]
//! \param sourceControl selects which controls the multiplexer.
//!        Valid values are:
//!        - \b SAPH_PHY_SOURCE_CONTROLLED_BY_REGISTER [Default]
//!        - \b SAPH_PHY_SOURCE_CONTROLLED_BY_ASQ
//! \param inputChannel selects input channel.
//!        Valid values are:
//!        - \b SAPH_PHY_INPUT_CHANNEL_0 [Default]
//!        - \b SAPH_PHY_INPUT_CHANNEL_1
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_configurePHYMultiplexer(uint16_t baseAddress,
        uint16_t enableDummyLoad, uint16_t sourceControl, uint16_t inputChannel);

//*****************************************************************************
//
//! \brief Configures physical interface bias.
//!
//! This configures SAPH physical interface bias parameters:
//! - excitation bias switch
//! - PGA bias
//! - excitation bias
//! - charge pump
//! - line input leakage
//! - compensation
//! - ASQ bias
//!
//! \param baseAddress is the base address of the SAPH module.
//! \param config is the pointer to the struct for physical interface bias configuration.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_configurePHYBias(uint16_t baseAddress,
        SAPH_configPHYBiasParam *config);

//*****************************************************************************
//
//! \brief Configures pulse generator count.
//!
//! This configures SAPH pulse generator count:
//! - high impedance
//! - pause level
//! - pause polarity
//! - stop pulse
//! - excitation pulse
//!
//! \param baseAddress is the base address of the SAPH module.
//! \param config is the pointer to the struct for pulse generator count configuration.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_configurePPGCount(uint16_t baseAddress,
        SAPH_configPPGCountParam *config);

//*****************************************************************************
//
//! \brief Sets pulse generator low period.
//!
//! The low phase of period of generator pulses defines the length of low phase
//! of the pulses in units of high speed clocks. The minimum count is two regardless
//! of the value set in this register.
//!
//! \param baseAddress is the base address of the SAPH module.
//! \param period is the low period value to set.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_setPPGLowPeriod(uint16_t baseAddress, uint16_t period);

//*****************************************************************************
//
//! \brief Sets pulse generator high period.
//!
//! The high phase of period of generator pulses defines the length of high phase
//! of the pulses in units of high speed clocks. The minimum count is two regardless
//! of the value set in this register.
//!
//! \param baseAddress is the base address of the SAPH module.
//! \param period is the high period value to set.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_setPPGHighPeriod(uint16_t baseAddress, uint16_t period);

//*****************************************************************************
//
//! \brief Configures pulse generator.
//!
//! This configures SAPH pulse generator:
//! - trigger source
//! - prescaler enable
//! - channel select
//! - control select
//!
//! \param baseAddress is the base address of the SAPH module.
//! \param config is the pointer to the struct for pulse generator configuration.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_configurePPG(uint16_t baseAddress, SAPH_configPPGParam *config);

//*****************************************************************************
//
//! \brief Triggers pulse generator.
//!
//! This function triggers the pulse generator if SAPH_PPG_TRIGGER_SOURCE_SOFTWARE
//! is selected as the trigger sourcce.
//!
//! \param baseAddress is the base address of the SAPH module.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_triggerPPG(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Stops pulse generator.
//!
//! \param baseAddress is the base address of the SAPH module.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_stopPPG(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Configures acquisition sequencer.
//!
//! This configures SAPH acquisition sequencer:
//! - trigger source
//! - abort-on-error control
//! - channel select
//! - side of channel to receive
//! - standby indication
//! - OFF at end-of-sequence
//! - early receive bias
//! - channel toggle
//!
//! \param baseAddress is the base address of the SAPH module.
//! \param config is the pointer to the struct for acquisition sequencer configuration.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_configureASQ(uint16_t baseAddress, SAPH_configASQParam *config);

//*****************************************************************************
//
//! \brief Triggers acquisition sequencer.
//!
//! This function triggers the acquisition sequencer if SAPH_ASQ_TRIGGER_SOURCE_SOFTWARE
//! is selected as the trigger sourcce.
//!
//! \param baseAddress is the base address of the SAPH module.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_triggerASQ(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Stops acquisition sequencer.
//!
//! \param baseAddress is the base address of the SAPH module.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_stopASQ(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Gets ping counter of acquisition sequencer.
//!
//! This function returns ping counter which represents the number of acquistion
//! turns regardless if up/down direction is changed. The acquistion stops if
//! this count decrements from zero.
//!
//! \param baseAddress is the base address of the SAPH module.
//!
//! \return None
//!
//*****************************************************************************
extern uint8_t SAPH_getASQPingCounter(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Configures acquisition sequencer ping parameters.
//!
//! This configures SAPH acquisition sequencer ping:
//! - output polarity
//! - pause level
//! - pause impedance
//!
//! \param baseAddress is the base address of the SAPH module.
//! \param config is the pointer to the struct for acquisition sequencer ping 
//!        configuration.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_configureASQPing(uint16_t baseAddress,
        SAPH_configASQPingParam *config);

//*****************************************************************************
//
//! \brief Configures acquisition sequencer time base parameters.
//!
//! This configures SAPH acquisition sequencer time base parameters:
//! - power state
//! - prescaler start value
//!
//! \param baseAddress is the base address of the SAPH module.
//! \param prescalerStartValue is the ASQ prescaler start value.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_configureASQTimeBase(uint16_t baseAddress,
        uint16_t prescalerStartValue);

//*****************************************************************************
//
//! \brief Starts acquisition timer.
//!
//! \param baseAddress is the base address of the SAPH module.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_startASQTimer(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Stops acquisition timer.
//!
//! \param baseAddress is the base address of the SAPH module.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_stopASQTimer(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Clears acquisition timer.
//!
//! \param baseAddress is the base address of the SAPH module.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_clearASQTimer(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Configures certain mode configuration parameters.
//!
//! This configures SAPH:
//! - bias generator impedance
//! - charge pump enable timing
//! - low power bias mode
//! \n\b NOTE: This will modify all elements of SAPH mode configuration register. If there are elements not specified in the config parameter, the register values will be cleared. There are other SAPH functions to modify these features individually.
//!
//! \param baseAddress is the base address of the SAPH module.
//! \param config is the pointer to the struct for mode configuration.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_configureMode(uint16_t baseAddress,
        SAPH_configModeParam *config);

//*****************************************************************************
//
//! \brief Enables low power bias operation mode.
//!
//! In this mode, the SAPH acquisition sequencer (ASQ) uses the CHxEBSW and PGABSW as auxiliary values to achieve faster channel setting on reactive input loads. The ASQ has full controls over the bias switch multiplexer.
//! \n\b NOTE: Avoid changing operation mode unless PSQ is in OFF state. Otherwise, it can cause corrupt measurement results and irregular triggers of sub modules by ASQ.
//!
//! \param baseAddress is the base address of the SAPH module.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_enableLowPowerBiasMode(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Disables low power bias operation mode.
//!
//! Enters manual bias mode and regular ASQ bias mode. In this configuration, the user controls by the ASQBSW has full control over TxBias and RxBias switches.
//! \n\b NOTE: Avoid changing operation mode unless PSQ is in OFF state. Otherwise, it can cause corrupt measurement results and irregular triggers of sub modules by ASQ.
//!
//! \param baseAddress is the base address of the SAPH module.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_disableLowPowerBiasMode(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Keeps charge pump of the input multiplexer always on.
//!
//! The charge pump of the input multiplexer is on regardless of SDHS and ASQ requests. This setting will override other USS charge pump settings elsewhere.
//!
//! \param baseAddress is the base address of the SAPH module.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_enableChargePumpAlways(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Charge pump of input multiplexer is only turned on by data acquisition.
//!
//! The charge pump of the input multiplexer is turned on by SDHS and ASQ related requests only. This will also require the charge pump to be enabled explicitly through other methods [controlled by CPDA bit or SAPH_configurePHYBias()] in the SAPH module.
//!
//! \param baseAddress is the base address of the SAPH module.
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_enableChargePumpOnAcquisitionOnly(uint16_t baseAddress);

//*****************************************************************************
//
//! \brief Sets impedance of the buffers for RxBias and TxBias.
//!
//! While for resistive loads the lowest impedance shows the fastest settling; this is not the case for reactive loads.
//!
//! \param baseAddress is the base address of the SAPH module.
//! \param biasImpedance sets bias impedance for RxBias and TxBias.
//!        Valid values are:
//!        - \b SAPH_MCNF_500_OHMS_RXBIAS_450_OHMS_TXBIAS
//!        - \b SAPH_MCNF_900_OHMS_RXBIAS_850_OHMS_TXBIAS
//!        - \b SAPH_MCNF_1500_OHMS_RXBIAS_1450_OHMS_TXBIAS [Default]
//!        - \b SAPH_MCNF_2950_OHMS_RXBIAS_2900_OHMS_TXBIAS
//!
//! \return None
//!
//*****************************************************************************
extern void SAPH_setBiasGeneratorImpedance(uint16_t baseAddress, uint16_t biasImpedance);

//*****************************************************************************
//
// Mark the end of the C bindings section for C++ compilers.
//
//*****************************************************************************
#ifdef __cplusplus
}
#endif

#endif
#endif // __MSP430WARE_SAPH_H__

